In [3]:
import pandas as pd

In [2]:
cardiovascular_df = pd.read_csv("Cardiovascular_Disease.csv")
cardiovascular_df.head()

,patientid,age,gender,chestpain,restingBP,serumcholestrol,fastingbloodsugar,restingrelectro,maxheartrate,exerciseangia,oldpeak,slope,noofmajorvessels,target
0,103368,53,1,2,171,0,0,1,147,0,5.3,3,3,1
1,119250,40,1,0,94,229,0,1,115,0,3.7,1,1,0
2,119372,49,1,2,133,142,0,0,202,1,5.0,1,0,0
3,132514,43,1,0,138,295,1,1,153,0,3.2,2,2,1
4,146211,31,1,1,199,0,0,2,136,0,5.3,3,2,1

In [3]:
# Mencari nilai minimal dan maksimal dengan axis = 0
cardiovascular_df.agg(func= ['min','max'], axis = 0)

,patientid,age,gender,chestpain,restingBP,serumcholestrol,fastingbloodsugar,restingrelectro,maxheartrate,exerciseangia,oldpeak,slope,noofmajorvessels,target
min,103368,20,0,0,94,0,0,0,71,0,0.0,0,0,0
max,9990855,80,1,3,200,602,1,2,202,1,6.2,3,3,1

In [4]:
# Mencari nilai minimal dan maksimal dengan axis = 1
cardiovascular_df.agg(func=['min','max'], axis=1)

     min        max
0    0.0   103368.0
1    0.0   119250.0
2    0.0   119372.0
3    0.0   132514.0
4    0.0   146211.0
..   ...        ...
995  0.0  9949544.0
996  0.0  9953423.0
997  0.0  9965859.0
998  0.0  9988507.0
999  0.0  9990855.0

[1000 rows x 2 columns]

In [5]:
# Melakukan aggregasi pada kolom dan fungsi aggregasi yang berbeda
cardiovascular_df.agg({'age' : ['max'], 'serumcholestrol' : ['max', 'mean']})

       age  serumcholestrol
max   80.0          602.000
mean   NaN          311.447

**MINI EXERCISE**

In [4]:
bank_term_deposit = pd.read_csv("bank_term_deposit.csv")
bank_term_deposit.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [11]:
# Tampilkan tipe data dari setiap kolom
bank_term_deposit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

In [17]:
# Melakukan aggregasi min dan max pada kolom age dan balance
# Melakukan aggregasi mean pada kolom age
bank_term_deposit.agg({'age' : ['min','max','mean'], 'balance' : ['min','max']})

            age  balance
min   19.000000  -3313.0
max   87.000000  71188.0
mean  41.170095      NaN

In [5]:
bank_term_deposit.agg({'marital':['mode'],'education' : ['mode']})

   marital  education
      mode       mode
0  married  secondary